Documents/ESB/ESB_Consumer_0608/003TestSample/SAMPLE_XML_MUST/TDAccount/TD12_TDCalRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/TDAccount/TDCalRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>TDAccount</ServiceDomain>  
      <OperationName>TDCal</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:TDCalRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>TD12</v11:TxnId>  
        <v11:TxnNo>TD1200001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:Payload> 
          <!--Optional:-->  
          <v11:ArrngId>NEW</v11:ArrngId>  
          <v11:ProdId>STR</v11:ProdId>  
          <v11:Ccy>STR</v11:Ccy>  
          <v11:EffDate>STR</v11:EffDate>  
          <v11:CmmtmntInfo> 
            <v11:Amt>3500</v11:Amt> 
          </v11:CmmtmntInfo>  
          <v11:RenewInfo> 
            <v11:RenewPrd>STR</v11:RenewPrd>  
            <v11:RenewDateType>STR</v11:RenewDateType>  
            <v11:RenewType>STR</v11:RenewType> 
          </v11:RenewInfo>  
          <!--1 or more repetitions:-->  
          <v11:StlInfo> 
            <v11:DbAcctFlg>STR</v11:DbAcctFlg>  
            <v11:CrAcctFlg>STR</v11:CrAcctFlg> 
          </v11:StlInfo> 
        </v11:Payload> 
      </v11:ServiceBody> 
    </v11:TDCalRq> 
  </soap:Body> 
</soap:Envelope>
